In [88]:
import pandas as pd

In [ ]:
d = pd.ExcelFile('/content/Book1.xlsx')
data = d.parse('Sheet1')
data.head()

   Year  Population    Total  ...  Burglary  Larceny_Theft  Vehicle_Theft
0  1960   179323175  3384200  ...    912100        1855400         328200
1  1961   182992000  3488000  ...    949600        1913000         336000
2  1962   185771000  3752200  ...    994300        2089600         366800
3  1963   188483000  4109500  ...   1086400        2297800         408300
4  1964   191141000  4564600  ...   1213200        2514400         472800

[5 rows x 12 columns]

In [ ]:
d = data.groupby((data.Year//10)*10)
d.agg({'Population':'max'},{'Violen':'max'})

      Population
Year
1960   201385000
1970   220099000
1980   248239000
1990   272690813
2000   307006550
2010   318857056